package archive;

import java.util.Scanner;

/**
 * Код не мой, но он мне на столько понравился, что я решил его записать. Он переводит простые числа
 * в большие цифры, используя, почти что, один только массив - 55124:
 *
 *  *****  *****    *     ***      *
 *  *      *       **    *   *    **
 *  *      *      * *    *   *   * *
 *  ****   ****     *       *   *  *
 *      *      *    *      *    *****
 *  *   *  *   *    *     *        *
 *   ***    ***   *****  *****     *
 *
 *   Ну разве это не великолепно!! Просто гениально.
 */

public class printNumbers {
    public static void main(String[] args) {

    }
}
